app/views/trainings/_form.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."active" = 't' AND "employees"."trainer" = 't'
---
	  <%= form.input :trained_on %>
	  <%= form.input :trainer_id, :as => 'select', :collection => Employee.where(:active => true, :trainer => true) %>