app/views/trainings/grid.html.erb

			<% i=0 %>
			<% document.trainings.each do |training| %>
---
SELECT "trainings".* FROM "trainings" WHERE "trainings"."document_id" IN (4)


			<% if(i == 0 || document.trainings.count == 0 ) %>
---
SELECT COUNT(*) FROM "trainings" WHERE "trainings"."document_id" = 128