app/views/employees/_form.html.erb

		<%= f.input :username %>
		<%= f.input :departments, :collection => Department.order('lft ASC').all %>
---
SELECT "departments".* FROM "departments" ORDER BY lft ASC