app/views/employees/show.html.erb

SELECT "trainings".* FROM "trainings" WHERE "trainings"."employee_id" = 1
---

<% @employee.trainings.each do |training| %>