app/views/document_groups/show.html.erb

SELECT "documents".* FROM "documents" WHERE "documents"."document_group_id" = 1
---
  </tr>
  <% @document_group.documents.each do |document| %>