app/views/departments/_list_employees.html.erb

SELECT "employees".* FROM "employees" INNER JOIN "departments_employees" ON "employees"."id" = "departments_employees"."employee_id" WHERE "departments_employees"."department_id" = 1
---

<% @department.employees.each do |employee| %>