app/views/departments/_list_documents.html.erb


<% @department.documents.each do |document| %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."department_id" = 2