app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT "departments".* FROM "departments"

  def moveleft
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "6"]]

  def moveright
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "5"]]

  def show
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("lft", "name", "parent_id", "rgt") VALUES (?, ?, ?, ?)  [["lft", 1], ["name", "Shipping"], ["parent_id", nil], ["rgt", 2]]

  def update
    @department = Department.find(params[:id])

    respond_to do |format|
      if @department.update_attributes(params[:department])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "departments" SET "lft" = CASE WHEN "lft" BETWEEN 6 AND 7 THEN "lft" + 11 - 7 WHEN "lft" BETWEEN 8 AND 11 THEN "lft" + 6 - 8 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 6 AND 7 THEN "rgt" + 11 - 7 WHEN "rgt" BETWEEN 8 AND 11 THEN "rgt" + 6 - 8 ELSE "rgt" END, "parent_id" = CASE WHEN id = 7 THEN 2 ELSE "parent_id" END WHERE "departments"."id" IN (SELECT "departments"."id" FROM "departments" ORDER BY "departments"."lft")