app/controllers/document_groups_controller.rb

SELECT "document_groups".* FROM "document_groups"
---
  def index
    @document_groups = DocumentGroup.all

SELECT "document_groups".* FROM "document_groups" WHERE "document_groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @document_group = DocumentGroup.find(params[:id])

SELECT "document_groups".* FROM "document_groups" WHERE "document_groups"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @document_group = DocumentGroup.find(params[:id])