app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents"
---
  def index
    @documents = Document.all

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @document = Document.find(params[:id])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @document = Document.find(params[:id])

INSERT INTO "documents" ("created_at", "department_id", "name", "number", "training_type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @document = Document.new(params[:document])

    respond_to do |format|
      if @document.save

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "documents" SET "department_id" = 8, "updated_at" = '2011-07-27 17:02:43.674888' WHERE "documents"."id" = 1
---
  def update
    @document = Document.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "112"]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 112]]
---
  def destroy
    @document = Document.find(params[:id])
    @document.destroy