app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" ORDER BY last_name ASC
---
  def index
    @employees = Employee.order("last_name ASC").all

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @employee = Employee.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @employee = Employee.find(params[:id])

INSERT INTO "employees" ("active", "created_at", "first_name", "last_name", "trainer", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @employee = Employee.find(params[:id])