app/controllers/statuses_controller.rb

SELECT "statuses".* FROM "statuses"
---
  def index
    @statuses = Status.all

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @status = Status.find(params[:id])

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @status = Status.find(params[:id])

INSERT INTO "statuses" ("color", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["color", nil], ["created_at", Mon, 23 Jan 2012 18:25:28 UTC +00:00], ["name", nil], ["updated_at", Mon, 23 Jan 2012 18:25:28 UTC +00:00]]
---
  def create
    @status = Status.new(params[:status])

    respond_to do |format|
      if @status.save

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "statuses" SET "name" = 'Trained', "color" = 'green', "updated_at" = '2012-01-23 21:45:19.467973' WHERE "statuses"."id" = 1
---
  def update
    @status = Status.find(params[:id])

    respond_to do |format|
      if @status.update_attributes(params[:status])

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 3]]
---
  def destroy
    @status = Status.find(params[:id])
    @status.destroy