app/controllers/trainings_controller.rb

SELECT "statuses".* FROM "statuses"
---
  def grid
    @department = Department.find(params[:department])

    @document_groups = DocumentGroup.where('department_id' => params[:department]).includes(:documents => :trainings)
    @document_groups = @document_groups.order('trainings.trained_on DESC')

    @employees = Employee.includes(:departments, { :trainings => { :document => :document_group } })
    @employees = @employees.where('departments_employees.department_id' => params[:department]).order('last_name ASC')

    @statuses = Status.all