app/controllers/trainings_controller.rb

SELECT "trainings".* FROM "trainings" ORDER BY trained_on ASC
---
  def index
    @trainings = Training.order('trained_on ASC').all

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "documents".* FROM "documents" WHERE "documents"."department_id" IN (1, 4)
SELECT "trainings".* FROM "trainings" WHERE "trainings"."document_id" IN (4)
---
  def grid
    @department = Department.find(params[:department])

    @departments = Department.find(params[:department]).self_and_descendants.includes(:documents => :trainings)

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT 1  [["id", "grid"]]
---
  def show
    @training = Training.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT 1  [["id", "130"]]
---
  def new
    @training = Training.new
    #@training.trained_on = Time.now
    if(params[:employee])
      @training.employee = Employee.find(params[:employee])
    end
    if(params[:document])
      @training.document = Document.find(params[:document])

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @training = Training.find(params[:id])

INSERT INTO "trainings" ("created_at", "document_id", "employee_id", "expires", "status_id", "trained_on", "trainer_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @training = Training.new(params[:training])

    respond_to do |format|
      if @training.save

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "trainings" SET "trainer_id" = 2, "updated_at" = '2012-01-26 16:37:16.775533' WHERE "trainings"."id" = 5
---
  def update
    @training = Training.find(params[:id])

    respond_to do |format|
      if @training.update_attributes(params[:training])

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "trainings" WHERE "trainings"."id" = ?  [["id", 1]]
---
  def destroy
    @training = Training.find(params[:id])
    @training.destroy